# BLACK FRIDAY DATASET
#CLEANING AND PREPARING DATA FOR MODEL TRAINING

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
#importing tthe dataset
df_train=pd.read_csv("C:\\Users\\batra\\Downloads\\archive (5)\\train.csv")
df_train.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [3]:
#importing test data
df_test=pd.read_csv("C:\\Users\\batra\\Downloads\\archive (5)\\test.csv")
df_test.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,1000004,P00128942,M,46-50,7,B,2,1,1,11.0,NaN
1,1000009,P00113442,M,26-35,17,C,0,0,3,5.0,NaN
2,1000010,P00288442,F,36-45,1,B,4+,1,5,14.0,NaN
3,1000010,P00145342,F,36-45,1,B,4+,1,4,9.0,NaN
4,1000011,P00053842,F,26-35,1,C,1,0,4,5.0,12.0

In [4]:
df_test.columns

Index(['User_ID', 'Product_ID', 'Gender', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',
       'Product_Category_2', 'Product_Category_3'],
      dtype='object')

In [5]:
df_train.columns

Index(['User_ID', 'Product_ID', 'Gender', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',
       'Product_Category_2', 'Product_Category_3', 'Purchase'],
      dtype='object')

In [6]:
df=df_train.append(df_test)

C:\Users\batra\AppData\Local\Temp\ipykernel_11372\3238464827.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df=df_train.append(df_test)

In [7]:
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370.0
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200.0
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422.0
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057.0
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969.0

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 783667 entries, 0 to 233598
Data columns (total 12 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     783667 non-null  int64
 1   Product_ID                  783667 non-null  object
 2   Gender                      783667 non-null  object
 3   Age                         783667 non-null  object
 4   Occupation                  783667 non-null  int64
 5   City_Category               783667 non-null  object
 6   Stay_In_Current_City_Years  783667 non-null  object
 7   Marital_Status              783667 non-null  int64
 8   Product_Category_1          783667 non-null  int64
 9   Product_Category_2          537685 non-null  float64
 10  Product_Category_3          237858 non-null  float64
 11  Purchase                    550068 non-null  float64
dtypes: float64(3), int64(4), object(5)
memory usage: 77.7+ MB

In [9]:
#deleting user id
df.drop(['User_ID'],axis=1,inplace=True) #axis is 1 column wise vertically and inplace will remove user id and will update in df

In [ ]:
df

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370.0
1,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200.0
2,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422.0
3,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057.0
4,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969.0
...,...,...,...,...,...,...,...,...,...,...,...
233594,P00118942,F,26-35,15,B,4+,1,8,NaN,NaN,NaN
233595,P00254642,F,26-35,15,B,4+,1,5,8.0,NaN,NaN
233596,P00031842,F,26-35,15,B,4+,1,1,5.0,12.0,NaN
233597,P00124742,F,46-50,1,C,4+,0,10,16.0,NaN,NaN
233598,P00316642,F,46-50,0,B,4+,1,4,5.0,NaN,NaN

# Converting numerical data to Categorical data

In [ ]:
pd.get_dummies(df['Gender'])

# Handle Categorical Variable Gender

In [ ]:
df['Gender']=df['Gender'].map({'F':0,'M':1})#CONVERT ACCORDING TO CONDITION
df.head()

In [ ]:
#Handling Age (Categorical feature)

In [ ]:
df['Age'].unique()

In [ ]:
pd.get_dummies(df['Age'])

In [ ]:
df['Age']=df['Age'].map({'0-17':1,'18-25':2,'26-35':3,'36-45':4,'46-50':5,'51-55':6,'55+':7})

In [ ]:
df.head()

In [ ]:
#Second Way using Label Encoding

from sklearn import preprocessing
#Label_encoder object knows how to understand word labels.
label_encoder = preprocessing.LabelEncoder ()
# Encode Labels in column 'species'.
df['Age'] = label_encoder.fit_transform(df['Age'])
df [ 'Age'].unique()

In [ ]:
df.head()

In [ ]:
#fixing categorical city_category
df_city=pd.get_dummies(df['City_Category'],drop_first=True) 
#WHY DROP_FIRST  
#because whenever we have 3 categories 2 categories are sufficient to represent all the 3 categories

In [ ]:
df_city.head()

In [ ]:
df=pd.concat([df,df_city],axis=1)
df.head()

In [ ]:
df.drop('City_Category',axis=1,inplace=True)#inplace is used to make the operation permanent

In [ ]:
df.head()

# Checking Missing Values

In [ ]:
df.isnull().sum()

In [ ]:
df.shape

In [ ]:
##Focus on replacing missing values
df['Product_Category_1'].unique()

In [ ]:
df['Product_Category_2'].unique()

In [ ]:
df['Product_Category_3'].unique()

In [ ]:
df['Product_Category_2'].value_counts()

In [ ]:
df['Product_Category_2'].mode()[0]

In [ ]:
#Replacing missing values with mode
df['Product_Category_2']=df['Product_Category_2'].fillna(df['Product_Category_2'].mode()[0])

In [ ]:
df['Product_Category_2'].isnull().sum()

In [ ]:
#Replacing missing values in Product category 3
df['Product_Category_3'].unique()

In [ ]:
df['Product_Category_3'].isnull().sum()

In [ ]:
df['Product_Category_3'].value_counts()

In [ ]:
#Replacing Values with mode

df['Product_Category_3']=df['Product_Category_3'].fillna(df['Product_Category_3'].mode()[0])

In [ ]:
df['Product_Category_3'].isnull().sum()

In [ ]:
df.head()

In [ ]:
df.shape

In [ ]:
#
df['Stay_In_Current_City_Years'].unique()

In [ ]:
df['Stay_In_Current_City_Years']=df['Stay_In_Current_City_Years'].str.replace('+','')

In [ ]:
df.head()

In [ ]:

df.info()

In [ ]:
#Stay_In_Current_City_Years  783667 non-null  object  it is an object so we will have to convert this to integer

In [ ]:
##Convert object into integer
df['Stay_In_Current_City_Years']=df['Stay_In_Current_City_Years'].astype(int)
df.info()

In [ ]:
df.head()

In [ ]:
#B AND C ARE UNSIGNED INTEGERS SO CONVERTING BOTH OF THEM
df['B']=df['B'].astype(int)
df['C']=df['C'].astype(int)
df.info()

# Visualization

In [ ]:
sns.pairplot(df)

In [ ]:
# Visualization Age vs Purchase
sns.barplot('Age','Purchase',hue='Gender',data=df) #female:0 and male:1

#### Observation:Purchasing of men is high then women

In [ ]:
df.head()

In [ ]:
sns.barplot(x='Purchase', y='Occupation', hue='Gender', data=df)

In [ ]:
sns.barplot('Product_Category_1','Occupation',hue='Gender',data=df)

In [ ]:
df.head()

## Feature Scaling

In [ ]:
#df['Purchases'].isnull().sum()

In [ ]:
df['Purchases'].isnull()